### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.google_app_engine_standard_app_version.fmltc-app-v1 will be updated in-place
!   resource "google_app_engine_standard_app_version" "fmltc-app-v1" {
!       env_variables             = {
+           "ENVIRONMENT"   = "development"
            # (4 unchanged elements hidden)
        }
        id                        = "apps/ftc-ml-firstinspires-dev/services/default/versions/v1"
        name                      = "apps/ftc-ml-firstinspires-dev/services/default/versions/v1"
        # (8 unchanged attributes hidden)


!       deployment {

!           zip {
!               source_url  = "https://storage.googleapis.com/ftc-ml-firstinspires-dev-gae-source/f56b39c8459f1db7165bb7fa00231920.zip" -> "https://storage.googleapis.com/ftc-ml-firstinspires-dev-gae-source/a751fd2876caca40f75ddb7bea76ee99.zip"
                # (1 unchanged attribute hidden)
            }
        }


-       handlers {
-           auth_fail_action = "AUTH_FAIL_ACTION_REDIRECT" -> null
-           login            = "LOGIN_OPTIONAL" -> null
-           security_level   = "SECURE_OPTIONAL" -> null
-           url_regex        = ".*" -> null

-           script {
-               script_path = "auto" -> null
            }
        }


        # (8 unchanged blocks hidden)
    }

  # module.dev.google_cloudfunctions_function.perform-action will be updated in-place
!   resource "google_cloudfunctions_function" "perform-action" {
!       environment_variables = {
+           "PROJECT_ID" = "ftc-ml-firstinspires-dev"
-           "project_id" = "ftc-ml-firstinspires-dev" -> null
        }
        id                    = "projects/ftc-ml-firstinspires-dev/locations/us-central1/functions/perform_action"
        name                  = "perform_action"
!       source_archive_object = "cc9b8e2ab7acc38b2f59c300d13a8c7d.zip" -> "60d3c51ec06d0656e09ddbba91d22f8f.zip"
        # (12 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.dev.google_storage_bucket_object.app-server-archive must be replaced
-/+ resource "google_storage_bucket_object" "app-server-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "aMPNYA==" -> (known after apply)
!       detect_md5hash   = "9Ws5yEWfHbcWW7f6ACMZIA==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-gae-source-f56b39c8459f1db7165bb7fa00231920.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "9Ws5yEWfHbcWW7f6ACMZIA==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev-gae-source/o/f56b39c8459f1db7165bb7fa00231920.zip?generation=1633365773684191&alt=media" -> (known after apply)
-       metadata         = {} -> null
!       name             = "f56b39c8459f1db7165bb7fa00231920.zip" -> "a751fd2876caca40f75ddb7bea76ee99.zip" # forces replacement
!       output_name      = "f56b39c8459f1db7165bb7fa00231920.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev-gae-source/o/f56b39c8459f1db7165bb7fa00231920.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.cloud-function-archive must be replaced
-/+ resource "google_storage_bucket_object" "cloud-function-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "U2qmYw==" -> (known after apply)
!       detect_md5hash   = "zJuOKresw4svWcMA0TqMfQ==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-gcf-source-cc9b8e2ab7acc38b2f59c300d13a8c7d.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "zJuOKresw4svWcMA0TqMfQ==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev-gcf-source/o/cc9b8e2ab7acc38b2f59c300d13a8c7d.zip?generation=1633365784006439&alt=media" -> (known after apply)
-       metadata         = {} -> null
!       name             = "cc9b8e2ab7acc38b2f59c300d13a8c7d.zip" -> "60d3c51ec06d0656e09ddbba91d22f8f.zip" # forces replacement
!       output_name      = "cc9b8e2ab7acc38b2f59c300d13a8c7d.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev-gcf-source/o/cc9b8e2ab7acc38b2f59c300d13a8c7d.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```
</details>